---
kind: type
id: T:Autodesk.Revit.DB.Structure.FabricSheetLayoutPattern
source: html/a13c4016-99f3-fc97-51ef-0ec2d534295a.htm
---
# Autodesk.Revit.DB.Structure.FabricSheetLayoutPattern

The pattern for how the wires in Fabric Sheet are laid out.

## Syntax (C#)
```csharp
public enum FabricSheetLayoutPattern
```